import React from 'react';
import { Box, Typography, Divider } from '@mui/material';

const HomeArticle = ({ isAdmin }) => {
    const title = isAdmin
        ? '👤 Καλώς ήρθατε στον Πίνακα Ελέγχου του Διαχειριστή'
        : '👤 Καλώς ήρθατε στον Πίνακα Ελέγχου του Χρήστη';

    const defaultIntro =
        'Η πλατφόρμα DEVELOPMENT, στοχεύει στην παροχή λύσεων που αντιμετωπίζουν προκλήσεις σε εθνικό, ευρωπαϊκό αλλά και παγκόσμιο επίπεδο, μέσω της ανάπτυξης μιας καινοτόμου πλατφόρμας δυναμικής πρόβλεψης της ζήτησης με χρήση αλγορίθμων μηχανικής μάθησης (machine-learning), ποσοτικοποιώντας ταυτόχρονα και την προστιθέμενη αξία των δυναμικών προβλέψεων ζήτησης στο κόστος των εφοδιαστικών αλυσίδων μέσω χρήσης κατάλληλων αλγορίθμων διοίκησης λειτουργιών (operations-management), ώστε να ενισχύσει την αποτελεσματικότητα των εφοδιαστικών αλυσίδων μικρομεσαίων και μεγάλων επιχειρήσεων, εστιάζοντας στην υλοποίησης μιας υπηρεσίας που θα είναι εφικτό να χρησιμοποιηθεί χωρίς μεγάλα κόστη επένδυσης από τις ΜΜΕ.Η πλατφόρμα πραγματοποιήθηκε στο πλαίσιο της Δράσης «Επενδυτικά Σχέδια Καινοτομίας» με κωδικό ΚΜΡ6-0078774 και συγχρηματοδοτήθηκε από την Ευρωπαϊκή Ένωση (ΕΕ) και Εθνικούς πόρους μέσω του Προγράμματος «Κεντρική Μακεδονία» ΕΣΠΑ, 2021-2027. \n';

    const adminParagraph = `
    Ο πίνακας ελέγχου αποτελεί το κεντρικό σημείο διαχείρισης των χρηστών στη πλατφόρμα Development. Ως διαχειριστής, έχετε πρόσβαση σε ένα σύνολο λειτουργιών που σχετίζονται αποκλειστικά με τη διαχείριση των λογαριασμών των χρηστών. Μέσα από την σελίδα μπορείτε να:

    ➕ Δημιουργήσετε νέους χρήστες, συμπληρώνοντας στοιχεία όπως email, κωδικό πρόσβασης, ρόλο (π.χ. Χρήστης), τις λειτουργίες που θα χρησιμοποιούν, αλλά και τα ERP API URLs για τη σύνδεση του ERP με την πλατφόρμα Development.
    
    👥 Προβάλλετε ή να επεξεργαστείτε τα στοιχεία των εγγεγραμμένων χρηστών του συστήματος, με δυνατότητα αναζήτησης με βάση το email του χρήστη.
    `;

    const userParagraph = `
    Ως χρήστης έχετε τη δυνατότητα να χρησιμοποιήσετε τουλάχιστον μία από τις παρακάτω λειτουργίες, ανάλογα με τα δικαιώματα που σας έχουν ανατεθεί από τον διαχειριστή. Το περιβάλλον εργασίας έχει σχεδιαστεί για να σας προσφέρει εύκολη και ασφαλή πρόσβαση σε προηγμένα εργαλεία πρόβλεψης, αποθέματος και δρομολόγησης οχημάτων. Συγκεκριμένα, οι λειτουργίες είναι:
    
    📊 <strong>Πρόβλεψη Zήτησης</strong>: για κάθε SKU, μπορείτε να εκτελείτε προβλέψεις ζήτησης αξιοποιώντας τα εκπαιδευμένα μοντέλα μηχανικής μάθησης της πλατφόρμας. Με αυτόν τον τρόπο, προκύπτουν εκτιμήσεις για τις αναμενόμενες ποσότητες παραγγελιών σε εβδομαδιαία βάση.
    
    📦 <strong>Βελτιστοποίηση Αποθεμάτων</strong>: για κάθε SKU, μπορείτε να υπολογίσετε τη συνιστώμενη ποσότητα αποθέματος, είτε με αυτόματη άντληση παραμέτρων από το ERP είτε εισάγοντας τις δικές σας τιμές. Η πλατφόρμα υπολογίζει βασικούς δείκτες, όπως ποσότητα παραγγελίας (Q), σημείο αναπαραγγελίας (R), συνολικό κόστος κ.ά.
    
    🚚 <strong>Βελτιστοποίηση Δρομολόγησης Οχημάτων</strong>: μπορείτε να χρησιμοποιήσετε τη λειτουργία βελτιστοποίησης δρομολογίων με στόχο τη μείωση του κόστους μεταφοράς και την αποδοτική κατανομή φορτίων στα διαθέσιμα οχήματα. Το μοντέλο λαμβάνει υπόψη παραμέτρους όπως αποστάσεις, κυκλοφορία, κόστος μεταφορών, χωρητικότητα οχημάτων και άλλα.
    `;

    const secondParagraph = isAdmin ? adminParagraph : userParagraph;

    return (
        <Box>
            {/* Τίτλος */}
            <Typography variant="h5" component="h1" gutterBottom>
                {title}
            </Typography>

            {/* 1st Paragraph */}
            <Typography
                variant="body1"
                sx={{
                    whiteSpace: 'pre-line',
                    fontSize: '1.1rem',
                    mb: 2,
                }}
            >
                {defaultIntro}
            </Typography>

            <Divider/>

            {/* 2nd Paragraph */}
            <Typography
                variant="body1"
                sx={{
                    whiteSpace: 'pre-line',
                    fontSize: '1.05rem',
                    lineHeight: 1.1
                }}
                dangerouslySetInnerHTML={{ __html: secondParagraph }}
            />
        </Box>
    );
};

export default HomeArticle;
